{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Conv1D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D1","trainable":true,"batch_input_shape":[null,24,7],"dtype":"float32"}},{"class_name":"MaxPooling1D","config":{"pool_size":[2],"padding":"valid","strides":[2],"name":"max_pooling1d_MaxPooling1D1","trainable":true}},{"class_name":"Conv1D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D2","trainable":true,"batch_input_shape":[null,24,7],"dtype":"float32"}},{"class_name":"MaxPooling1D","config":{"pool_size":[2],"padding":"valid","strides":[2],"name":"max_pooling1d_MaxPooling1D2","trainable":true}},{"class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM1","trainable":true,"units":256,"activation":"relu","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional1","trainable":true,"batch_input_shape":[null,24,7],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.6,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true}},{"class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM2","trainable":true,"units":256,"activation":"relu","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional2","trainable":true,"batch_input_shape":[null,24,7],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true}},{"class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM3","trainable":true,"units":256,"activation":"relu","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional3","trainable":true,"batch_input_shape":[null,24,7],"dtype":"float32"}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true}},{"class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true}},{"class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout5","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"Layer11","trainable":true}}]},"keras_version":"tfjs-layers 3.7.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.7.0","convertedBy":null,"weightsManifest":[{"paths":["./CNN_Bi_LSTM_Model.weights.bin"],"weights":[{"name":"conv1d_Conv1D1/kernel","shape":[3,7,256],"dtype":"float32"},{"name":"conv1d_Conv1D1/bias","shape":[256],"dtype":"float32"},{"name":"conv1d_Conv1D2/kernel","shape":[3,256,256],"dtype":"float32"},{"name":"conv1d_Conv1D2/bias","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/kernel","shape":[256,1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/recurrent_kernel","shape":[256,1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/bias","shape":[1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/kernel","shape":[256,1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/recurrent_kernel","shape":[256,1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/bias","shape":[1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_lstm_LSTM2/kernel","shape":[512,1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_lstm_LSTM2/recurrent_kernel","shape":[256,1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_lstm_LSTM2/bias","shape":[1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_lstm_LSTM2/kernel","shape":[512,1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_lstm_LSTM2/recurrent_kernel","shape":[256,1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_lstm_LSTM2/bias","shape":[1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional3/forward_lstm_LSTM3/kernel","shape":[512,1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional3/forward_lstm_LSTM3/recurrent_kernel","shape":[256,1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional3/forward_lstm_LSTM3/bias","shape":[1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional3/backward_lstm_LSTM3/kernel","shape":[512,1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional3/backward_lstm_LSTM3/recurrent_kernel","shape":[256,1024],"dtype":"float32"},{"name":"bidirectional_Bidirectional3/backward_lstm_LSTM3/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[512,256],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[256,128],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[128],"dtype":"float32"},{"name":"Layer11/kernel","shape":[128,3],"dtype":"float32"},{"name":"Layer11/bias","shape":[3],"dtype":"float32"}]}]}